{
  "PersonalProjects": "Personal projects",
  "GroupProjects": "Group projects",
  "freeTier": "The live demos are deployed on free tier hosting services with limitations, please give them 2~5min to load up.",
  "ThisPortfolio": "This portfolio website",
  "TodoList": "Todo List",
  "TodoListContent": "A simple Todo-List web app I created for the purpose of learning fullstack web development.",
  "MyWebsite": "I built this portfolio website to showcase my projects and skills.",
  "Destruction4Dummies": "During the Games Lab course 2019 I and two other students developed a 2.5D Jump&Run with level editor.",
  "RhythmDungeon": "Together with two other students we made a 2D-Dungeon-RPG with the Microsoft Kinect.In this game you use your body to control the character and attack enemies.",
  "Groceryou": "Together with three other students we made a private to private grocery delivery web application.",
  "SoaperDuck": "In the Games Lab course 2020 I and three other students developed an endless runner.",
  "BachelorThesis": "Bachelor Thesis",
  "MasterThesis": "Master Thesis",
  "BachelorPresentation": "Bachelor presentation",
  "MasterPresentation": "Master presentation",
  "SeminarPaper": "Seminar paper",
  "SeminarPresentation": "Seminar presentation",
  "BachelorThesisContent": "In my bachelor's thesis, I extend an existing Japanese language learning serious games with new features and content. I implemented a Hiragana Mnemonics Training, a Drag&Drop minigame and used a point-cloud based algorithm to detect correct handwriting of Japanese letters.",
  "MasterThesisContent": "The goal of my master's thesis was to add Dynamic Difficulty Adjustment (DDA) to the project from my Bachelor thesis. The basic idea of DDA is to measure the player’s performance, analyze the data and based on the results make adjustments to difficulty factors within the application.",
  "MutationTesting": "Mutation testing is the process of making small code changes to your code and checking whether or not your unit test cases can detect those changes.",
  "PythonForJavaDevelopers": "Python for Java developers",
  "PythonForJavaDevelopersContent": "Lecture slides I made for Prof. Dr. Georg Groh. The slides introduce the programming language Python to students with prior knowledge in Java.",
  "LectureSlides": "Lecture slides",
  "PGdPSlides": "Fundamentals of Programming Tutor Slides",
  "PGdPContent": "I created over 600 slides to teach first semester students the basics of programming in Java.",
  "SocialGamingTutorial": "Social Gaming example implementation",
  "SocialGamingTutorialContent": "An example implementation tutorial I made for the Social Gaming Lab Course. This tutorial introduces the students to the following concepts: Android Studio, a simple REST API with Spring Boot, how to save JSON data into MongoDB, Firebase Authentication, and Open Street Maps integration.",
  "DefendersOfEarth": "Old AR multiplayer shooter made with Unity, Firebase, and Mirror",
  "GlobalGalaxy": "My very first game I ever made."
}