{
  "GameProjects": "Spiele Projekte",
  "WebProjects": "Web Projekte",
  "PersonalProjects": "Private Projekte",
  "GroupProjects": "Gruppenprojekte",
  "freeTier": "Die Live-Demos werden auf Free-Tier-Hosting-Services mit Einschränkungen bereitgestellt, bitte geben Sie den Projekten 2 bis 5 Minuten zum Laden.",
  "ThisPortfolio": "Diese Portfolio Webseite",
  "TodoList": "Todo Liste",
  "TodoListContent": "Eine einfache Todo-Liste, mein erstes Fullstack-Projekt.",
  "MyWebsite": "Ich habe diese Portfolio-Website erstellt, um meine Projekte und Fähigkeiten zu präsentieren.",
  "Destruction4Dummies": "Während des Games Lab Kurses 2019 habe ich mit zwei anderen Studenten ein 2.5D Jump&Run mit Leveleditor entwickelt.",
  "RhythmDungeon": "Zusammen mit zwei anderen Studenten haben wir ein 2D-Dungeon-RPG mit der Microsoft Kinect erstellt. In diesem Spiel benutzt du deinen Körper, um die Figur zu steuern und Feinde anzugreifen.",
  "Groceryou": "Zusammen mit drei anderen Studenten haben wir eine Webanwendung für die Lieferung von Lebensmitteln durch angestellte Einkäufer zu Privatperson entwickelt.",
  "SoaperDuck": "Im Games Lab Kurs 2020 habe ich zusammen mit drei weiteren Studierenden einen \"endless runner\" entwickelt.",
  "BachelorThesis": "Bachelorarbeit",
  "MasterThesis": "Masterarbeit",
  "BachelorPresentation": "Bachelor Präsentation",
  "MasterPresentation": "Master Präsentation",
  "SeminarPaper": "Seminararbeit",
  "SeminarPresentation": "Seminar Präsentation",
  "BachelorThesisContent": "Ich habe ein Hiragana-Mnemonik-Training implementiert, ein Drag&Drop-Minispiel und einen auf Punktwolken basierten Algorithmus verwendet, um die korrekte Handschrift japanischer Buchstaben zu erkennen.",
  "MasterThesisContent": "Das Ziel meiner Masterarbeit war es, das Projekt aus meiner Bachelorarbeit um Dynamic Difficulty Adjustment zu erweitern. Die Grundidee von Dynamic Difficulty Adjustment (DDA) besteht darin, die Leistung des Spielers zu messen, die Daten zu analysieren und basierend auf den Ergebnissen Schwierigkeitsanpassungen an verschiedenen Faktoren innerhalb der Anwendung vorzunehmen.",
  "MutationTesting": "Beim Mutationstesten werden kleine Codeänderungen am Code vorgenommen und überprüft, ob die vorhandenen Unit-Testfälle diese Änderungen erkennen können.",
  "PythonForJavaDevelopers": "Python für Java Entwickler",
  "PythonForJavaDevelopersContent": "Vorlesungsfolien, die ich für Prof. Dr. Georg Groh erstellt habe. Die Folien führen Studierende mit Vorkenntnissen in Java in die Programmiersprache Python ein.",
  "LectureSlides": "Vorlesungsfolien",
  "PGdPSlides": "Java Programmierpraktikum Folien",
  "PGdPContent": "Ich habe über 600 Folien erstellt, um Erstsemesterstudenten die Grundlagen der Programmierung in Java zu vermitteln.",
  "SocialGamingTutorial": "Social Gaming Beispielimplementierung",
  "SocialGamingTutorialContent": "Ein Beispielimplementierung, die ich für den Social Gaming Lab Course erstellt habe. Dieses Tutorial führt die Schüler in die folgenden Konzepte ein: Android Studio, eine einfache REST-API mit Spring Boot, Speichern von JSON-Daten in MongoDB, Firebase-Authentifizierung und Open Street Maps Integration."
}